Revit 2027 API
ParameterTypeId.StairsWinderpatternNumberOfStraightStepsAtBegin Property
 "Parallel Treads at Start": Number of straight steps at the begin of winder
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsWinderpatternNumberOfStraightStepsAtBegin { get; }
Public Shared ReadOnly Property StairsWinderpatternNumberOfStraightStepsAtBegin As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsWinderpatternNumberOfStraightStepsAtBegin {
	ForgeTypeId^ get ();
}
static member StairsWinderpatternNumberOfStraightStepsAtBegin : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace